---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CableTrayModified
source: html/db9ab6cb-e139-a669-b919-dbb7eae97ed3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CableTrayModified Property

The cable tray has been modified to be in the opposite direction or insufficient space to create the required fittings.

## Syntax (C#)
```csharp
public static FailureDefinitionId CableTrayModified { get; }
```